import 'package:flight_schedule/presentation/pages/reference_info/templates/plain_reference_info.dart';
import 'package:flutter/material.dart';

class AnimalsTransportationPage extends PlainReferenceInfoPage {
  AnimalsTransportationPage({Key? key})
      : super(
          key: key,
          title: "Транспортировка животных",
          texts: [
            "О перевозке животного на борту самолета пассажиру необходимо сообщить в авиакомпанию еще при покупке авиабилета, т.к. не все авиакомпании разрешают такую перевозку на своих рейсах.",
            "Все вопросы о разрешении на ввоз данного вида и породы животного уточните в консульстве страны назначения.",
            "Пассажир должен иметь сертификат, выданный компетентным государственным учреждением и другие документы, требуемые ветеринарными органами любой страны, на территорию, с территории или через территорию которой осуществляется перевозка.",
            "Количество соответствующих багажных мест для перевозки животных на каждом воздушном судне разное, поэтому сразу же уточните условия провоза: стоимость перевозки, гарантии перевозчика, нормы транспортировки. Учитывайте при этом особенности поведения Вашего питомца.",
            "Приём к перевозке животных производится при условии, что пассажир берет на себя всю ответственность за них. Перевозчик не отвечает за телесные повреждения, утрату, задержку в доставке, заболевания или смерть таких животных, равно как в случае отказа в их ввозе или провозе через любую страну или территорию.",
            "Если животное по каким‐либо параметрам не подходит для перевозки в салоне самолета, оно перевозится в багажном отделении воздушного судна только в закрытых специальных клетках или контейнерах, которые должны соответствовать международному стандарту IATA. Если эти требования не соблюдены, авиаперевозчик может не принять клетку на борт. Кроме того, у авиакомпаний есть свои требования к перевозкам животных, о которых нужно узнать заранее.",
            "",
            "Если Вы перевозите животных, птиц или растения, то необходимо пройти фитоконтроль и ветеринарный контроль (тел. +7 (4242) 788–297).",
            "",
            "Информацию, относящуюся к установленной сфере деятельности Россельхознадзора, также можно получить на официальном сайте Федеральной службы по ветеринарному и фитосанитарному надзору (www.fsvps.ru).",
          ],
        );
}
