import 'package:flight_schedule/presentation/pages/reference_info/templates/plain_reference_info.dart';
import 'package:flutter/material.dart';

class ChildrenTransportationPage extends PlainReferenceInfoPage {
  ChildrenTransportationPage({Key? key})
      : super(
          key: key,
          title: "Транспортировка детей",
          texts: [
            "Уважаемые пассажиры, при бронировании билета вы должны предупредить авиакомпанию о том, что вы собираетесь осуществить перелет с маленьким ребенком.",
            "Уважаемые пассажиры, при бронировании билета вы должны предупредить авиакомпанию о том, что вы собираетесь осуществить перелет с маленьким ребенком.",
            'Пассажиры, путешествующие с детьми, в аэропорту Южно‐Сахалинск могут воспользоваться услугами комнаты матери и ребенка, находящейся в здании гостиницы кафе "Борщ и грезы"  (тел. +7 (4242) 788–888).',
            "Более подробно об услугах, предоставляемых пассажирам с детьми, вы можете узнать у вашей авиакомпании.",
            "",
            "",
            "Порядок выезда за границу несовершеннолетних граждан Российской Федерации",
            "",
            "1. Каждый гражданин Российской Федерации после достижения 18-ти лет при выезде за границу должен иметь свой заграничный паспорт.",
            "2. Несовершеннолетние граждане Российской Федерации в возрасте до 18-ти лет могут выезжать за границу при наличии собственного паспорта или если они вписаны в паспорта совместно следующих с ними родителей и других законных представителей.",
            "3. Порядок вписания детей в заграничный паспорт:",
            "а) указывается фамилия, имя и дата рождения детей;",
            "б) фамилия и имя ребенка дублируется на французском языке;",
            "в) запись скрепляется подписью сотрудника, ее оформившего и печатью для заграничных документов.",
            "На детей в паспортах должны быть фотокарточки, скрепленные гербовыми печатями органов МИД или МВД Российской Федерации.",
            "4. Для гражданина Российской Федерации, не достигшего 18 лет, выезжающего из Российской Федерации совместно с родителями (либо с одним из родителей), усыновителями, опекунами или попечителями нотариально оформленного согласия указанных лиц не требуется.",
            "5. Если гражданин Российской Федерации, не достигший 18 лет, выезжает из России без сопровождения вышеуказанных лиц, он должен иметь при себе, кроме паспорта, нотариально оформленное согласие одного из указанных лиц на выезд несовершеннолетнего гражданина Российской Федерации с указанием срока выезда и государства (государств), которое (которые) он намерен посетить.",
            "",
            "Законными представителями несовершеннолетних российских граждан являются родители, усыновители, опекуны, попечители. В случае если один из родителей, усыновителей, опекунов или попечителей заявит о своем несогласии на выезд из Российской Федерации несовершеннолетнего гражданина Российской Федерации, вопрос о возможности его выезда из Российской Федерации разрешается в судебном порядке.",
            "Гражданин Российской Федерации, признанный судом недееспособным, по ходатайству родителей, усыновителей или опекунов может выехать из Российской Федерации в сопровождении совершеннолетнего лица, способного обеспечить безопасность недееспособного гражданина Российской Федерации и безопасность окружающих людей.",
          ],
        );
}
